taurus-gatling.yml
settings:
  artifacts-dir: artifacts

modules:
  gatling:
    version: 3.13.5

execution:
  - executor: gatling
    concurrency: 10
    ramp-up: 30s
    hold-for: 2m
    scenario: gatling-test

scenarios:
  gatling-test:
    script: gatling
    simulation: ${SIMULATION}

reporting:
  - module: console
  - module: final-stats